In [1]:
import pandas as pd
import numpy as np
from numpy import nan
from pandas import Series,DataFrame
import os

In [80]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
df=DataFrame(data,columns=['year','state','pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [31]:
df=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [46]:
#リストで数字を渡してあげると、列を指定
df[[0]]

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9

In [48]:
#カラム名を指定してもよい
df[['pop']]

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9

In [50]:
#これだとオブジェクトで返ってくる
df['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [ ]:
#リストの中に数字→NG
df[0]

In [29]:
#リストの中にリスト
df[[0]]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [28]:
#リストの中に文字列
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [30]:
#リストの中にリスト
df[['year']]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [ ]:
df['year','state'] →NG

In [ ]:
#リストの中に2次元配列
df[['year'],['state']]　→　NG

In [35]:
#2つ以上取得したい場合はリストにして渡してあげる。
df[['year','state']]

       year   state
one    2000    Ohio
two    2001    Ohio
three  2002    Ohio
four   2001  Nevada
five   2002  Nevada

▼データを取り出す

■ixメゾットは、行を取り出すメゾット。方法としては、行ラベルを記載するか、行番号を入れるか。

In [38]:
df.ix[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [39]:
df.ix[0,1]

'Ohio'

In [41]:
df.ix[[0,1],[2,3]]

     pop debt
one  1.5  NaN
two  1.7  NaN

In [43]:
#ilocは行列番号で指定
df.iloc[[0,1],[2,3]]

     pop debt
one  1.5  NaN
two  1.7  NaN

In [44]:
df.loc[[0,1],[2,3]]

KeyError: 'None of [[0, 1]] are in the [index]'

In [45]:
df.loc[['one','two'],['pop','debt']]

     pop debt
one  1.5  NaN
two  1.7  NaN

In [54]:
#データの冒頭5行を取得
df.head(5)

#データの末尾5行を取得
df.tail(5)

#データフレーム全体のデータ型の確認
df.info()

#データの件数や統計量を確認
df.describe()

#データの型の確認
type(df)

#列のデータ型の確認
type(df['pop'])

#データ型の変更
#今回はprice列が文字列だったのでfloat型に変更
df['pop'] = df['pop'].astype(np.float64)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 4 columns):
year     5 non-null int64
state    5 non-null object
pop      5 non-null float64
debt     0 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 140.0+ bytes

In [12]:
df.dtypes

pop      float64
state     object
year       int64
dtype: object

In [13]:
pop={'Nevada':{2001:2.4,2001:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [14]:
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.9   1.7
2002     NaN   3.6

In [15]:
DataFrame(pop,index=[2003,2001,2002,])

      Nevada  Ohio
2003     NaN   NaN
2001     2.9   1.7
2002     NaN   3.6

In [16]:
df1=DataFrame(np.arange(12).reshape(4,3),columns=list('abc'),index=['Sapporo','Kawasaki','Shimane','Akita'])
df1

          a   b   c
Sapporo   0   1   2
Kawasaki  3   4   5
Shimane   6   7   8
Akita     9  10  11

In [17]:
df2=DataFrame(np.arange(9).reshape(3,3),columns=list('abc'),index=['Sapporo','Yamagata','Kawasaki'])
df2

          a  b  c
Sapporo   0  1  2
Yamagata  3  4  5
Kawasaki  6  7  8

In [18]:
df1+df2

           a   b   c
Akita    NaN NaN NaN
Kawasaki   9  11  13
Sapporo    0   2   4
Shimane  NaN NaN NaN
Yamagata NaN NaN NaN

In [19]:
pd.merge(df1,df2,left_index=True,right_index=True)

          a_x  b_x  c_x  a_y  b_y  c_y
Sapporo     0    1    2    0    1    2
Kawasaki    3    4    5    6    7    8

In [20]:
pd.merge(df1,df2,left_index=True,right_index=True,how='outer')

          a_x  b_x  c_x  a_y  b_y  c_y
Akita       9   10   11  NaN  NaN  NaN
Kawasaki    3    4    5    6    7    8
Sapporo     0    1    2    0    1    2
Shimane     6    7    8  NaN  NaN  NaN
Yamagata  NaN  NaN  NaN    3    4    5

In [ ]:
df2=DataFrame(np.arange(9).reshape(3,3),columns=list('cde'),index=['Sapporo','Yamagata','Kawasaki'])
df2

In [ ]:
df1+df2

In [ ]:
df1.add(df2,fill_value=0)

In [ ]:
df3=df1.add(df2,fill_value=0)
df3>3

In [ ]:
df3[2:]

In [ ]:
df3[df3['d']>=4]

In [94]:
frame=DataFrame(np.arange(12).reshape((4,3)),index=list('abcd'),columns=list('123'))
frame

   1   2   3
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [97]:
#シリーズを作る
frame.ix[0]

1    0
2    1
3    2
Name: a, dtype: int32

In [40]:
frame=DataFrame(np.arange(12).reshape((4,3)),index=['2001','2002','2003','2004'],columns=['NY','LA','CA'])
frame

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [41]:
series=frame.ix[1]
series

NY    3
LA    4
CA    5
Name: 2002, dtype: int32

In [42]:
frame-series

      NY  LA  CA
2001  -3  -3  -3
2002   0   0   0
2003   3   3   3
2004   6   6   6

In [48]:
series1=Series(np.arange(3),index=['NY','LA','DC'])
series1

NY    0
LA    1
DC    2
dtype: int32

In [49]:
frame-series1

      CA  DC  LA  NY
2001 NaN NaN   0   0
2002 NaN NaN   3   3
2003 NaN NaN   6   6
2004 NaN NaN   9   9

In [50]:
frame

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [51]:
frame.sort_index()

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [55]:
frame.sort_index(ascending=False)

      NY  LA  CA
2004   9  10  11
2003   6   7   8
2002   3   4   5
2001   0   1   2

In [52]:
frame.sort_index(axis=1)

      CA  LA  NY
2001   2   1   0
2002   5   4   3
2003   8   7   6
2004  11  10   9

In [53]:
frame

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [54]:
frame.order()

AttributeError: 'DataFrame' object has no attribute 'order'

In [58]:
ser1=Series(np.random.randn(4))

In [60]:
ser1.order()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -1.425992
3   -0.205805
0    0.223687
1    0.529936
dtype: float64

In [61]:
ser2=Series(np.random.randn(100))

In [62]:
ser2.sum()

-11.528039064458806

In [63]:
ser2.mean()

-0.11528039064458806

In [64]:
ser2.describe()

count    100.000000
mean      -0.115280
std        0.940799
min       -2.755663
25%       -0.607408
50%       -0.117536
75%        0.517254
max        2.569548
dtype: float64

In [65]:
frame

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [71]:
frame.drop('2001')

      NY  LA  CA
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [72]:
frame

      NY  LA  CA
2001   0   1   2
2002   3   4   5
2003   6   7   8
2004   9  10  11

In [73]:
frame.drop('NY',axis=1)

      LA  CA
2001   1   2
2002   4   5
2003   7   8
2004  10  11

In [87]:
data=Series(['NY',nan,'CA'])

In [88]:
data.isnull()

0    False
1     True
2    False
dtype: bool

In [91]:
data.dropna()

0    NY
2    CA
dtype: object

In [92]:
data

0     NY
1    NaN
2     CA
dtype: object

In [93]:
data[data.notnull()]

0    NY
2    CA
dtype: object

In [94]:
data[data.isnull()]

1    NaN
dtype: object

In [25]:
df=DataFrame(np.random.randn(3),
             index=[['Sapporo','Yamagata','Kawasaki'],['a','b','a']])
df

                   0
Sapporo  a -1.486397
Yamagata b -1.516998
Kawasaki a -0.940725

In [15]:
df.swaplevel(0,1)

ValueError: Length mismatch: Expected axis has 5 elements, new values have 10 elements

In [13]:
df[[0]].ix[[1]]

         Sapporo
2002 b -0.566415

In [20]:
df[[1]].ix[[0]]=nan

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [21]:
Series([0,1,2,nan,4])

0     0
1     1
2     2
3   NaN
4     4
dtype: float64

In [23]:
df[[1]].ix[[0]]=10

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [24]:
obj=Series([0,1,2,nan,4])

In [25]:
obj[0]=5

In [26]:
obj

0     5
1     1
2     2
3   NaN
4     4
dtype: float64

In [27]:
df[[1]]=5

In [28]:
df

         Sapporo  Kawasaki   Shimane     Akita  Yamagata
2001 a  0.070751         5 -0.078821  1.597769  0.678803
2002 b  1.324200         5 -0.553855  1.305446  1.528476
2003 a  0.368142         5  0.718094  1.011375 -0.161667
2004 b  0.409398         5  0.475909  1.763170  1.754970
2005 a  0.172839         5 -1.176568 -0.174169 -1.989948

In [30]:
df[[1]].[[2]]=10

SyntaxError: invalid syntax (<ipython-input-30-72ced0fc8125>, line 1)

In [34]:
df.index.names=['year','month']
df.columns.names=['city']

In [35]:
df

city         Sapporo  Kawasaki   Shimane     Akita  Yamagata
year month
2001 a      0.070751         5 -0.078821  1.597769  0.678803
2002 b      1.324200         5 -0.553855  1.305446  1.528476
2003 a      0.368142         5  0.718094  1.011375 -0.161667
2004 b      0.409398         5  0.475909  1.763170  1.754970
2005 a      0.172839         5 -1.176568 -0.174169 -1.989948

In [41]:
df.swaplevel('month','year')

TypeError: 'tuple' object is not callable

In [4]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [5]:
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['Cities','Temp']
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [7]:
dframe2.swaplevel('INDEX_1','INDEX_2')
#もとデータが変わるわけではない

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_2 INDEX_1
1       a          0   1   2    3
2       a          4   5   6    7
1       b          8   9  10   11
2       b         12  13  14   15

In [11]:
dframe2.swaplevel(0,1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_2 INDEX_1
1       a          0   1   2    3
2       a          4   5   6    7
1       b          8   9  10   11
2       b         12  13  14   15

# ▼where

In [2]:
s1 = pd.Series([1, 2, 3], index = ['I1', 'I2', 'I3'])

df1 = pd.DataFrame({'C1': [11, 21, 31],
                    'C2': [12, 22, 32],
                    'C3': [13, 23, 33]},
                   index = ['I1', 'I2', 'I3'])

In [3]:
s1

I1    1
I2    2
I3    3
dtype: int64

In [4]:
s1[s1>2]

I3    3
dtype: int64

In [5]:
s1.where(s1>2)

I1   NaN
I2   NaN
I3     3
dtype: float64

In [6]:
s1.where(s1>2,0)

I1    0
I2    0
I3    3
dtype: int64

In [7]:
s1.where(s1 > 2, np.array([4, 5, 6]))

I1    4
I2    5
I3    3
dtype: int64

In [8]:
s2 = pd.Series([4, 5, 6], index = ['I1', 'I2', 'I3'])

In [9]:
s1.where(s1 > 2, s2)

I1    4
I2    5
I3    3
dtype: int64

In [10]:
df1

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [11]:
df1.where(df1 > 22)

    C1  C2  C3
I1 NaN NaN NaN
I2 NaN NaN  23
I3  31  32  33

In [12]:
df1.where(df1 > 22,0)

    C1  C2  C3
I1   0   0   0
I2   0   0  23
I3  31  32  33

In [13]:
df2 = pd.DataFrame({'C1': [44, 54, 64],
                    'C2': [45, 55, 65],
                    'C3': [46, 56, 66]},
                   index = ['I1', 'I2', 'I3'])

In [14]:
df2

    C1  C2  C3
I1  44  45  46
I2  54  55  56
I3  64  65  66

In [15]:
df1.where(df1 > 22,df2)

    C1  C2  C3
I1  44  45  46
I2  54  55  23
I3  31  32  33

In [16]:
df1

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [17]:
df1['C4'] = df1['C2'].where(df1['C2'] > 30,df2['C2'])

In [18]:
df1

    C1  C2  C3  C4
I1  11  12  13  45
I2  21  22  23  55
I3  31  32  33  32

# ▼余談

In [19]:
#TrueかFlaseでデータが返ってくる
df1 > 30

       C1     C2     C3    C4
I1  False  False  False  True
I2  False  False  False  True
I3   True   True   True  True

In [20]:
#bool型のTrueの部分だけが返ってくる
df1[df1 > 30]

    C1  C2  C3  C4
I1 NaN NaN NaN  45
I2 NaN NaN NaN  55
I3  31  32  33  32

# ▼mask

In [21]:
df1.where(df1>25)

    C1  C2  C3  C4
I1 NaN NaN NaN  45
I2 NaN NaN NaN  55
I3  31  32  33  32

In [22]:
df1.mask(df1>25)

    C1  C2  C3  C4
I1  11  12  13 NaN
I2  21  22  23 NaN
I3 NaN NaN NaN NaN

# ▼isin

In [23]:
df1

    C1  C2  C3  C4
I1  11  12  13  45
I2  21  22  23  55
I3  31  32  33  32

In [26]:
df1[df1.isin([22,23])]

    C1  C2  C3  C4
I1 NaN NaN NaN NaN
I2 NaN  22  23 NaN
I3 NaN NaN NaN NaN

In [35]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
df[df.isin(['Ohio'])]

   pop state  year
0  NaN  Ohio   NaN
1  NaN  Ohio   NaN
2  NaN  Ohio   NaN
3  NaN   NaN   NaN
4  NaN   NaN   NaN

# ▼contains

In [60]:
df['state'].str.contains('Ohio')

0     True
1     True
2     True
3    False
4    False
Name: state, dtype: bool

In [61]:
df[df['state'].str.contains('Ohio')]

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

# ▼query

In [73]:
df[(df['pop']>=2.0) & (df['pop']<=3.0)]

   pop   state  year
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [74]:
df.query('pop >= 2.0 and pop < 3.0')

   pop   state  year
3  2.4  Nevada  2001
4  2.9  Nevada  2002

# ▼drop

In [85]:
df.drop((df['pop']>=2.0) & (df['pop']<=3.0))

   pop   state  year
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

TypeError: 'DataFrame' object is not callable

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

# ▼concat

In [86]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

In [91]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

In [95]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

In [89]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [92]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [94]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [97]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [98]:
pd.concat([df1,df4])

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

# ▼groupby

In [2]:
df=DataFrame({'key1':['a','a','b','b','a'],
              'key2':['one','two','one','two','one'],
              'data1':np.random.randn(5),
              'data2':np.random.randn(5)})

In [6]:
#一般的なグループ化
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.729422 -0.400378
     two   0.660954  0.342402
b    one   0.965934  0.232106
     two  -0.410911 -1.910696

In [7]:
#少し冗長なので…
df1=df[['key1','key2','data1']]
df1.groupby(['key1','key2']).mean()

              data1
key1 key2
a    one  -0.729422
     two   0.660954
b    one   0.965934
     two  -0.410911

In [8]:
#少し冗長なので…
df1=df[['key1','key2','data1']].groupby(['key1','key2']).mean()

In [3]:
#1行でやると…
df[['data1','key1','key2']].groupby(['key1','key2']).mean()

              data1
key1 key2
a    one  -0.729422
     two   0.660954
b    one   0.965934
     two  -0.410911